# пример 1
# [10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0]
def вывод_10чисел(список10):
    список=[]
    while список10>0:
        список10-=1
        список.append(список10)
    return список
print(вывод_10чисел(11))

# пример 2
# сумма [1,2,3,4,5]
def сумма(список_чисел):
    цикл=0
    for переменная in список_чисел:
        цикл+=переменная
    return цикл
print(сумма([1,2,3,4,5]))

# пример 3
# компас
def компас(координата_x,координата_y):
    if координата_x>0 and координата_y>0:
        print("юг")
    elif координата_x<0 and координата_y<0:
        print("север")
    elif координата_x>0 and координата_y<0:
        print("восток")
    elif координата_x<0 and координата_y>0:
        print("запад")
    else:
        print("неизвестно")
компас(3,4)
